# Temporary View Modes Properties

Source: https://www.revitapidocs.com/2026/55fca398-bba6-0ff8-1818-58c659be2aca.htm

---

| Temporary View Modes Properties |
| --- |

The TemporaryViewModes type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | AcceleratedGraphicsMode | The current state of the Accelerated Graphics mode in the associated view. |
|  | CustomColor | Custom color for the TemporaryViewProperties mode. |
|  | CustomTitle | Custom title for the TemporaryViewProperties mode. |
|  | IsReadOnly | Identifies if the object is read\-only or modifiable. (Inherited from APIObject ) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | PreviewFamilyVisibility | The current state of the PreviewFamilyVisibility mode in the associated view. |
|  | PreviewFamilyVisibilityDefaultOnState | Controls the default state of the PreviewFamilyVisibility mode in all views. |
|  | PreviewFamilyVisibilityDefaultUncutState | Controls the default type of the On state of the PreviewFamilyVisibility mode in cut\-able views. |
|  | RevealConstraints | The current state of the RevealConstraints mode in the associated view. |
|  | RevealHiddenElements | The current state of the RevealHiddenElements mode in the associated view. |
|  | WorksharingDisplay | The current state of the WorksharingDisplay mode in the associated view. |

Top See Also

#### Reference

TemporaryViewModes Class Autodesk.Revit.DB Namespace